avrxml/AS6-Devices-XML/ATSAM3N1B.xml
        <register caption="Fast Startup Mode Register" name="PMC_FSMR" offset="0x0070" rw="RW" size="4">
          <bitfield caption="Fast Startup Input Enable 0" mask="0x00000001" name="FSTT0"/>
          <bitfield caption="Fast Startup Input Enable 1" mask="0x00000002" name="FSTT1"/>
          <bitfield caption="Fast Startup Input Enable 2" mask="0x00000004" name="FSTT2"/>
          <bitfield caption="Fast Startup Input Enable 3" mask="0x00000008" name="FSTT3"/>
          <bitfield caption="Fast Startup Input Enable 4" mask="0x00000010" name="FSTT4"/>
          <bitfield caption="Fast Startup Input Enable 5" mask="0x00000020" name="FSTT5"/>
          <bitfield caption="Fast Startup Input Enable 6" mask="0x00000040" name="FSTT6"/>
          <bitfield caption="Fast Startup Input Enable 7" mask="0x00000080" name="FSTT7"/>
          <bitfield caption="Fast Startup Input Enable 8" mask="0x00000100" name="FSTT8"/>
          <bitfield caption="Fast Startup Input Enable 9" mask="0x00000200" name="FSTT9"/>
          <bitfield caption="Fast Startup Input Enable 10" mask="0x00000400" name="FSTT10"/>
          <bitfield caption="Fast Startup Input Enable 11" mask="0x00000800" name="FSTT11"/>
          <bitfield caption="Fast Startup Input Enable 12" mask="0x00001000" name="FSTT12"/>
          <bitfield caption="Fast Startup Input Enable 13" mask="0x00002000" name="FSTT13"/>
          <bitfield caption="Fast Startup Input Enable 14" mask="0x00004000" name="FSTT14"/>
          <bitfield caption="Fast Startup Input Enable 15" mask="0x00008000" name="FSTT15"/>
          <bitfield caption="RTT Alarm Enable" mask="0x00010000" name="RTTAL"/>
          <bitfield caption="RTC Alarm Enable" mask="0x00020000" name="RTCAL"/>
          <bitfield caption="Low Power Mode" mask="0x00100000" name="LPM"/>
        </register>
        <register caption="Fast Startup Polarity Register" name="PMC_FSPR" offset="0x0074" rw="RW" size="4">
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00000001" name="FSTP0"/>
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00000002" name="FSTP1"/>
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00000004" name="FSTP2"/>
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00000008" name="FSTP3"/>
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00000010" name="FSTP4"/>
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00000020" name="FSTP5"/>
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00000040" name="FSTP6"/>
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00000080" name="FSTP7"/>
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00000100" name="FSTP8"/>
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00000200" name="FSTP9"/>
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00000400" name="FSTP10"/>
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00000800" name="FSTP11"/>
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00001000" name="FSTP12"/>
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00002000" name="FSTP13"/>
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00004000" name="FSTP14"/>
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00008000" name="FSTP15"/>
        </register>
        <register caption="Fault Output Clear Register" name="PMC_FOCR" offset="0x0078" rw="W" size="4">
          <bitfield caption="Fault Output Clear" mask="0x00000001" name="FOCLR"/>
        </register>
        <register caption="Write Protect Mode Register" name="PMC_WPMR" offset="0x00E4" rw="RW" size="4">
          <bitfield caption="Write Protect Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect KEY" mask="0xFFFFFF00" name="WPKEY"/>
        </register>
        <register caption="Write Protect Status Register" name="PMC_WPSR" offset="0x00E8" rw="R" size="4">
          <bitfield caption="Write Protect Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protect Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="" name="CKGR_MOR__MOSCRCF">
        <value caption="The Fast RC Oscillator Frequency is at 4 MHz (default)" name="_4_MHz" value="0x0"/>
        <value caption="The Fast RC Oscillator Frequency is at 8 MHz" name="_8_MHz" value="0x1"/>
        <value caption="The Fast RC Oscillator Frequency is at 12 MHz" name="_12_MHz" value="0x2"/>
      </value-group>
      <value-group caption="" name="PMC_MCKR__CSS">
        <value caption="Slow Clock is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="Main Clock is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLA Clock is selected" name="PLLA_CLK" value="0x2"/>
      </value-group>
      <value-group caption="" name="PMC_MCKR__PRES">
        <value caption="Selected clock" name="CLK_1" value="0x0"/>
        <value caption="Selected clock divided by 2" name="CLK_2" value="0x1"/>
        <value caption="Selected clock divided by 4" name="CLK_4" value="0x2"/>
        <value caption="Selected clock divided by 8" name="CLK_8" value="0x3"/>
        <value caption="Selected clock divided by 16" name="CLK_16" value="0x4"/>
        <value caption="Selected clock divided by 32" name="CLK_32" value="0x5"/>
        <value caption="Selected clock divided by 64" name="CLK_64" value="0x6"/>
        <value caption="Selected clock divided by 3" name="CLK_3" value="0x7"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__CSS">
        <value caption="Slow Clock is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="Main Clock is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLA Clock is selected" name="PLLA_CLK" value="0x2"/>
        <value caption="Master Clock is selected" name="MCK" value="0x4"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__PRES">
        <value caption="Selected clock" name="CLK_1" value="0x0"/>
        <value caption="Selected clock divided by 2" name="CLK_2" value="0x1"/>
        <value caption="Selected clock divided by 4" name="CLK_4" value="0x2"/>
        <value caption="Selected clock divided by 8" name="CLK_8" value="0x3"/>
        <value caption="Selected clock divided by 16" name="CLK_16" value="0x4"/>
        <value caption="Selected clock divided by 32" name="CLK_32" value="0x5"/>
        <value caption="Selected clock divided by 64" name="CLK_64" value="0x6"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__CSS">
        <value caption="Slow Clock is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="Main Clock is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLA Clock is selected" name="PLLA_CLK" value="0x2"/>
        <value caption="Master Clock is selected" name="MCK" value="0x4"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__PRES">
        <value caption="Selected clock" name="CLK_1" value="0x0"/>
        <value caption="Selected clock divided by 2" name="CLK_2" value="0x1"/>
        <value caption="Selected clock divided by 4" name="CLK_4" value="0x2"/>
        <value caption="Selected clock divided by 8" name="CLK_8" value="0x3"/>
        <value caption="Selected clock divided by 16" name="CLK_16" value="0x4"/>
        <value caption="Selected clock divided by 32" name="CLK_32" value="0x5"/>
        <value caption="Selected clock divided by 64" name="CLK_64" value="0x6"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__CSS">
        <value caption="Slow Clock is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="Main Clock is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLA Clock is selected" name="PLLA_CLK" value="0x2"/>
        <value caption="Master Clock is selected" name="MCK" value="0x4"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__PRES">
        <value caption="Selected clock" name="CLK_1" value="0x0"/>
        <value caption="Selected clock divided by 2" name="CLK_2" value="0x1"/>
        <value caption="Selected clock divided by 4" name="CLK_4" value="0x2"/>
        <value caption="Selected clock divided by 8" name="CLK_8" value="0x3"/>
        <value caption="Selected clock divided by 16" name="CLK_16" value="0x4"/>
        <value caption="Selected clock divided by 32" name="CLK_32" value="0x5"/>
        <value caption="Selected clock divided by 64" name="CLK_64" value="0x6"/>
      </value-group>
    </module>
    <module caption="Pulse Width Modulation Controller" name="PWM" version="6044I">
      <register-group name="PWM">
        <register caption="PWM Mode Register" name="PWM_MR" offset="0x00" rw="RW" size="4">
          <bitfield caption="CLKA, CLKB Divide Factor" mask="0x000000FF" name="DIVA" values="PWM_MR__DIVA"/>
          <bitfield caption="" mask="0x00000F00" name="PREA" values="PWM_MR__PREA"/>
          <bitfield caption="CLKA, CLKB Divide Factor" mask="0x00FF0000" name="DIVB" values="PWM_MR__DIVB"/>
          <bitfield caption="" mask="0x0F000000" name="PREB" values="PWM_MR__PREB"/>
        </register>
