avrxml/AS6-Devices-XML/ATSAM3N1B.xml
        <register offset="0x00000008" size="4" name="CVR" initval="0" caption="SysTick Current Value Register">
          <bitfield mask="0x00ffffff" name="CURRENT" caption="Current value at the time the register is accessed"/>
        </register>
        <register offset="0x0000000c" size="4" name="CALIB" initval="0" caption="SysTick Calibration Value Register">
          <bitfield mask="0x00ffffff" name="TENMS" caption="Reload value to use for 10ms timing"/>
          <bitfield mask="0x40000000" name="SKEW" values="SKEW" caption="no description available"/>
          <bitfield mask="0x80000000" name="NOREF" values="NOREF" caption="no description available"/>
        </register>
      </register-group>
      <value-group name="ENABLE">
        <value value="0" name="VALUE_0" caption="counter disabled"/>
        <value value="1" name="VALUE_1" caption="counter enabled"/>
      </value-group>
      <value-group name="TICKINT">
        <value value="0" name="VALUE_0" caption="counting down to 0 does not assert the SysTick exception request"/>
        <value value="1" name="VALUE_1" caption="counting down to 0 asserts the SysTick exception request"/>
      </value-group>
      <value-group name="CLKSOURCE">
        <value value="0" name="VALUE_0" caption="external clock"/>
        <value value="1" name="VALUE_1" caption="processor clock"/>
      </value-group>
      <value-group name="SKEW">
        <value value="0" name="VALUE_0" caption="10ms calibration value is exact"/>
        <value value="1" name="VALUE_1" caption="10ms calibration value is inexact, because of the clock frequency"/>
      </value-group>
      <value-group name="NOREF">
        <value value="0" name="VALUE_0" caption="The reference clock is provided"/>
        <value value="1" name="VALUE_1" caption="The reference clock is not provided"/>
      </value-group>
    </module>
    <module name="NVIC" caption="Nested Vectored Interrupt Controller">
      <register-group name="NVIC" caption="Nested Vectored Interrupt Controller">
        <register offset="0x00000000" size="4" name="NVICISER0" initval="0" caption="Interrupt Set Enable Register n">
          <bitfield mask="0xffffffff" name="SETENA" caption="Interrupt set enable bits"/>
        </register>
        <register offset="0x00000004" size="4" name="NVICISER1" initval="0" caption="Interrupt Set Enable Register n">
          <bitfield mask="0xffffffff" name="SETENA" caption="Interrupt set enable bits"/>
        </register>
        <register offset="0x00000008" size="4" name="NVICISER2" initval="0" caption="Interrupt Set Enable Register n">
          <bitfield mask="0xffffffff" name="SETENA" caption="Interrupt set enable bits"/>
        </register>
        <register offset="0x0000000c" size="4" name="NVICISER3" initval="0" caption="Interrupt Set Enable Register n">
          <bitfield mask="0xffffffff" name="SETENA" caption="Interrupt set enable bits"/>
        </register>
        <register offset="0x00000080" size="4" name="NVICICER0" initval="0" caption="Interrupt Clear Enable Register n">
          <bitfield mask="0xffffffff" name="CLRENA" caption="Interrupt clear-enable bits"/>
        </register>
        <register offset="0x00000084" size="4" name="NVICICER1" initval="0" caption="Interrupt Clear Enable Register n">
          <bitfield mask="0xffffffff" name="CLRENA" caption="Interrupt clear-enable bits"/>
        </register>
        <register offset="0x00000088" size="4" name="NVICICER2" initval="0" caption="Interrupt Clear Enable Register n">
          <bitfield mask="0xffffffff" name="CLRENA" caption="Interrupt clear-enable bits"/>
        </register>
        <register offset="0x0000008c" size="4" name="NVICICER3" initval="0" caption="Interrupt Clear Enable Register n">
          <bitfield mask="0xffffffff" name="CLRENA" caption="Interrupt clear-enable bits"/>
        </register>
        <register offset="0x00000100" size="4" name="NVICISPR0" initval="0" caption="Interrupt Set Pending Register n">
          <bitfield mask="0xffffffff" name="SETPEND" caption="Interrupt set-pending bits"/>
        </register>
        <register offset="0x00000104" size="4" name="NVICISPR1" initval="0" caption="Interrupt Set Pending Register n">
          <bitfield mask="0xffffffff" name="SETPEND" caption="Interrupt set-pending bits"/>
        </register>
        <register offset="0x00000108" size="4" name="NVICISPR2" initval="0" caption="Interrupt Set Pending Register n">
          <bitfield mask="0xffffffff" name="SETPEND" caption="Interrupt set-pending bits"/>
        </register>
        <register offset="0x0000010c" size="4" name="NVICISPR3" initval="0" caption="Interrupt Set Pending Register n">
          <bitfield mask="0xffffffff" name="SETPEND" caption="Interrupt set-pending bits"/>
        </register>
        <register offset="0x00000180" size="4" name="NVICICPR0" initval="0" caption="Interrupt Clear Pending Register n">
          <bitfield mask="0xffffffff" name="CLRPEND" caption="Interrupt clear-pending bits"/>
        </register>
        <register offset="0x00000184" size="4" name="NVICICPR1" initval="0" caption="Interrupt Clear Pending Register n">
          <bitfield mask="0xffffffff" name="CLRPEND" caption="Interrupt clear-pending bits"/>
        </register>
        <register offset="0x00000188" size="4" name="NVICICPR2" initval="0" caption="Interrupt Clear Pending Register n">
          <bitfield mask="0xffffffff" name="CLRPEND" caption="Interrupt clear-pending bits"/>
        </register>
        <register offset="0x0000018c" size="4" name="NVICICPR3" initval="0" caption="Interrupt Clear Pending Register n">
          <bitfield mask="0xffffffff" name="CLRPEND" caption="Interrupt clear-pending bits"/>
        </register>
        <register offset="0x00000200" size="4" name="NVICIABR0" initval="0" caption="Interrupt Active bit Register n">
          <bitfield mask="0xffffffff" name="ACTIVE" caption="Interrupt active flags"/>
        </register>
        <register offset="0x00000204" size="4" name="NVICIABR1" initval="0" caption="Interrupt Active bit Register n">
          <bitfield mask="0xffffffff" name="ACTIVE" caption="Interrupt active flags"/>
        </register>
        <register offset="0x00000208" size="4" name="NVICIABR2" initval="0" caption="Interrupt Active bit Register n">
          <bitfield mask="0xffffffff" name="ACTIVE" caption="Interrupt active flags"/>
        </register>
        <register offset="0x0000020c" size="4" name="NVICIABR3" initval="0" caption="Interrupt Active bit Register n">
          <bitfield mask="0xffffffff" name="ACTIVE" caption="Interrupt active flags"/>
        </register>
        <register offset="0x00000300" size="1" name="NVICIP0" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI0" caption="Priority of interrupt 0"/>
        </register>
