avrxml/AS6-Devices-XML/ATSAM3N1B.xml
        <register offset="0x0000033f" size="1" name="NVICIP63" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI63" caption="Priority of interrupt 63"/>
        </register>
        <register offset="0x00000340" size="1" name="NVICIP64" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI64" caption="Priority of interrupt 64"/>
        </register>
        <register offset="0x00000341" size="1" name="NVICIP65" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI65" caption="Priority of interrupt 65"/>
        </register>
        <register offset="0x00000342" size="1" name="NVICIP66" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI66" caption="Priority of interrupt 66"/>
        </register>
        <register offset="0x00000343" size="1" name="NVICIP67" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI67" caption="Priority of interrupt 67"/>
        </register>
        <register offset="0x00000344" size="1" name="NVICIP68" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI68" caption="Priority of interrupt 68"/>
        </register>
        <register offset="0x00000345" size="1" name="NVICIP69" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI69" caption="Priority of interrupt 69"/>
        </register>
        <register offset="0x00000346" size="1" name="NVICIP70" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI70" caption="Priority of interrupt 70"/>
        </register>
        <register offset="0x00000347" size="1" name="NVICIP71" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI71" caption="Priority of interrupt 71"/>
        </register>
        <register offset="0x00000348" size="1" name="NVICIP72" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI72" caption="Priority of interrupt 72"/>
        </register>
        <register offset="0x00000349" size="1" name="NVICIP73" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI73" caption="Priority of interrupt 73"/>
        </register>
        <register offset="0x0000034a" size="1" name="NVICIP74" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI74" caption="Priority of interrupt 74"/>
        </register>
        <register offset="0x0000034b" size="1" name="NVICIP75" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI75" caption="Priority of interrupt 75"/>
        </register>
        <register offset="0x0000034c" size="1" name="NVICIP76" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI76" caption="Priority of interrupt 76"/>
        </register>
        <register offset="0x0000034d" size="1" name="NVICIP77" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI77" caption="Priority of interrupt 77"/>
        </register>
        <register offset="0x0000034e" size="1" name="NVICIP78" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI78" caption="Priority of interrupt 78"/>
        </register>
        <register offset="0x0000034f" size="1" name="NVICIP79" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI79" caption="Priority of interrupt 79"/>
        </register>
        <register offset="0x00000350" size="1" name="NVICIP80" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI80" caption="Priority of interrupt 80"/>
        </register>
        <register offset="0x00000351" size="1" name="NVICIP81" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI81" caption="Priority of interrupt 81"/>
        </register>
        <register offset="0x00000352" size="1" name="NVICIP82" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI82" caption="Priority of interrupt 82"/>
        </register>
        <register offset="0x00000353" size="1" name="NVICIP83" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI83" caption="Priority of interrupt 83"/>
        </register>
        <register offset="0x00000354" size="1" name="NVICIP84" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI84" caption="Priority of interrupt 84"/>
        </register>
        <register offset="0x00000355" size="1" name="NVICIP85" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI85" caption="Priority of interrupt 85"/>
        </register>
        <register offset="0x00000356" size="1" name="NVICIP86" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI86" caption="Priority of interrupt 86"/>
        </register>
        <register offset="0x00000357" size="1" name="NVICIP87" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI87" caption="Priority of interrupt 87"/>
        </register>
        <register offset="0x00000358" size="1" name="NVICIP88" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI88" caption="Priority of interrupt 88"/>
        </register>
        <register offset="0x00000359" size="1" name="NVICIP89" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI89" caption="Priority of interrupt 89"/>
        </register>
        <register offset="0x0000035a" size="1" name="NVICIP90" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI90" caption="Priority of interrupt 90"/>
        </register>
        <register offset="0x0000035b" size="1" name="NVICIP91" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI91" caption="Priority of interrupt 91"/>
        </register>
        <register offset="0x0000035c" size="1" name="NVICIP92" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI92" caption="Priority of interrupt 92"/>
        </register>
